---
kind: method
id: M:Autodesk.Revit.DB.PaperSizeSet.Contains(Autodesk.Revit.DB.PaperSize)
source: html/c814df5e-f724-2aed-8acf-5d0305a97bf7.htm
---
# Autodesk.Revit.DB.PaperSizeSet.Contains Method

Tests for the existence of an item within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	PaperSize item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PaperSize`) - The item to be searched for.

## Returns
The Contains method returns True if the item is within the set, otherwise False.